base/Documents/бит_пз_СводнаяЗаявкаНаЗатраты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_пз_СводнаяЗаявкаНаЗатраты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_пз_ПланируемыеЗатраты</xr:Item>
				<xr:Item>AccumulationRegister.бит_пз_ПланируемыеЗатратыАналитика</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_пз_ВидыОперацийЗаявокНаЗатраты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЖелаемаяДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_Важность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Comment>Ручная корректировка - служебный реквизит</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Comment>Курс документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьДокумента</Name>
					<Comment>Кратность документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗаявкиНаЗатраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяОборотов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСтавкаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СтавкаНДС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоступления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_4</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_5</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_6</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_7</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_8</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_9</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_10</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_11</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_12</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаявкаНаЗатраты</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.бит_пз_ЗаявкаНаЗатраты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.бит_СтавкаНДС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

base/Documents/бит_пз_СводнаяЗаявкаНаЗатраты/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	бит_НастройкиДоступностиЭлементовФорм.ПриСозданииНаСервере(ЭтотОбъект, СтандартнаяОбработка, Объект);	
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	
	МетаданныеОбъекта = Объект.Ссылка.Метаданные();
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Если Параметры.Свойство("ДокументОснование") Тогда
	
		Если ЗначениеЗаполнено(Параметры.ДокументОснование) Тогда
			ДокОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.бит_пз_СводнаяЗаявкаНаЗатраты"));
			ДокОбъект.Заполнить(Параметры.ДокументОснование);
			ЗначениеВДанныеФормы(ДокОбъект, Объект);
			
			Для каждого СтрокаТабличнойЧасти Из Объект.ЗаявкиНаЗатраты Цикл
			
				ПриИзмененииСумма(СтрокаТабличнойЧасти.Сумма
									, СтрокаТабличнойЧасти.СуммаНДС
									, СтрокаТабличнойЧасти.СуммаСНДС
									, СтрокаТабличнойЧасти.СтавкаНДС);
			
			КонецЦикла; 
			
		КонецЕсли; 
				
	КонецЕсли; 
	
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений();
	
	Если Параметры.Свойство("ВидОперации") Тогда
	
		Объект.ВидОперации = Параметры.ВидОперации;
	
	КонецЕсли; 
	
	// Настроим отображение полей доп. аналитик в форме.
	бит_МеханизмДопИзмерений.ОтобразитьДополнительныеИзмеренияВТабличномПоле_Управляемая(ЭтотОбъект
																					,"ЗаявкиНаЗатраты"
																				 	,мКэшЗначений.ИзмеренияДоп
																				 	,мКэшЗначений.НастройкиИзмерений);
																					
	// Обновляем группу итоги
	ОбновитьИтоги(ЭтотОбъект);
	
	ПодготовитьФормуНаСервере(СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	 
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПодборЗаявокНаЗатраты" 
		И Источник = ЭтотОбъект Тогда
		
		ОбработкаЗаполненияИзПодбора(Параметр);	
		
		УправлениеЭлементамиФормы();
		
		// Обновляем группу итоги
		ОбновитьИтоги(ЭтотОбъект);
			
	ИначеЕсли ИмяСобытия = "бит_ИзмененСтатус" Тогда
		
		ОбработкаОповещенияИзмененияСтатуса();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если бит_НастройкиДоступностиЭлементовФормКлиентСервер.ФормаПодготовлена(ЭтотОбъект) Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	 
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

#Область СтандартныеПодсистемыОбработчикиКоманд

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(Знач ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

&НаКлиенте
Процедура КомандаПодбор(Команда)
	
	Если Модифицированность ИЛИ НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Оповещение = Новый ОписаниеОповещения("ВопросОткрытьОбработкуПодбораЗавершение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru='Для продолжения необходимо записать документ. Выполнить запись?';
							|en='To continue, you must write the document. Record?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 15, КодВозвратаДиалога.Нет);
		
	Иначе	
		
		// Безусловное открытие обработки
		ОткрытиеОбработкиПодборЗаявокНаЗатраты();
		
	КонецЕсли;	
	
КонецПроцедуры

//  Процедура обработчик оповещения вопроса о необходимости записи документа 
// при открытии обработки заполнения. 
// 
&НаКлиенте
Процедура ВопросОткрытьОбработкуПодбораЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		флОК = Записать();
		
		Если флОК Тогда
			ОткрытиеОбработкиПодборЗаявокНаЗатраты();
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры // ВопросОткрытьОбработкуПодбораЗавершение	

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ЗаявкиНаЗатратыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ОбновитьИтоги(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаДокументаПриИзменении(Элемент)
	
	ВалютаДокументаПриИзмененииСервер();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТабличнойЧасти

&НаКлиенте
Процедура ЗаявкиНаЗатратыКоличествоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ЗаявкиНаЗатраты.ТекущиеДанные;
	ПриИзмененииКоличествоЦена(СтрокаТабличнойЧасти.Сумма
								, СтрокаТабличнойЧасти.Количество
								, СтрокаТабличнойЧасти.Цена
								, СтрокаТабличнойЧасти.СуммаНДС
								, СтрокаТабличнойЧасти.СуммаСНДС
								, СтрокаТабличнойЧасти.СтавкаНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиНаЗатратыСуммаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ЗаявкиНаЗатраты.ТекущиеДанные;
	
	ПриИзмененииСумма(СтрокаТабличнойЧасти.Сумма
						, СтрокаТабличнойЧасти.СуммаНДС
						, СтрокаТабличнойЧасти.СуммаСНДС
						, СтрокаТабличнойЧасти.СтавкаНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиНаЗатратыЦенаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ЗаявкиНаЗатраты.ТекущиеДанные;
	ПриИзмененииКоличествоЦена(СтрокаТабличнойЧасти.Сумма
								, СтрокаТабличнойЧасти.Количество
								, СтрокаТабличнойЧасти.Цена
								, СтрокаТабличнойЧасти.СуммаНДС
								, СтрокаТабличнойЧасти.СуммаСНДС
								, СтрокаТабличнойЧасти.СтавкаНДС);
								
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиНаЗатратыНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ЗаявкиНаЗатраты.ТекущиеДанные;
	НоменклатураПриИзмененииСервер(СтрокаТабличнойЧасти.ПолучитьИдентификатор());
	
КонецПроцедуры

// Процедура - обработчик события "НачалоВыбора" полей ввода "Аналитика_<N>".
//
&НаКлиенте
Процедура ЗаявкиНаЗатратыАналитика_НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ЗаявкиНаЗатраты.ТекущиеДанные;
	ИмяАналитики  = СтрЗаменить(Элемент.Имя, "ЗаявкиНаЗатраты", "");
	
	бит_МеханизмДопИзмеренийКлиент.ВыбратьТипСоставнойАналитики(ЭтотОбъект
	                                                      	   ,Элемент
															   ,ТекущиеДанные
															   ,ИмяАналитики
															   ,СтандартнаяОбработка
															   ,мКэшЗначений.НастройкиИзмерений);
	
КонецПроцедуры // ЗаявкиНаЗатратыАналитика_НачалоВыбора()

// Процедура - обработчик события "АвтоПодбор" полей ввода "Аналитика_<N>".
//
&НаКлиенте
Процедура ЗаявкиНаЗатратыАналитика_АвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
    
    ТекущиеДанные = Элементы.ЗаявкиНаЗатраты.ТекущиеДанные;
	ИмяАналитики  = СтрЗаменить(Элемент.Имя, "ЗаявкиНаЗатраты", "");
	
	бит_МеханизмДопИзмеренийКлиент.ВыбратьТипСоставнойАналитики(ЭтотОбъект
	                                                      	   ,Элемент
															   ,ТекущиеДанные
															   ,ИмяАналитики
															   ,СтандартнаяОбработка
															   ,мКэшЗначений.НастройкиИзмерений);
                                                               
КонецПроцедуры // ЗаявкиНаЗатратыАналитика_АвтоПодбор()

// Процедура - обработчик события "Очистка" полей ввода "Аналитика_<N>".
//
&НаКлиенте
Процедура ЗаявкиНаЗатратыАналитика_Очистка(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ЗаявкиНаЗатраты.ТекущиеДанные;
	ИмяАналитики  = СтрЗаменить(Элемент.Имя, "ЗаявкиНаЗатраты", "");
	
	бит_МеханизмДопИзмеренийКлиент.ОбработкаОчисткиДополнительногоИзмерения(Элемент
																			,ТекущиеДанные
	                                                                       	,ИмяАналитики
																		   	,СтандартнаяОбработка
																		   	,мКэшЗначений.НастройкиИзмерений);
	
КонецПроцедуры // ЗаявкиНаЗатратыАналитика_Очистка()

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = бит_ОбщегоНазначения.СостояниеДокумента(Объект);
	
КонецПроцедуры

//  Процедура заполняет кэш значений, необходимый при работе на клиенте.
// 
&НаСервере
Процедура ЗаполнитьКэшЗначений()
	
	мКэшЗначений = Новый Структура;
	
	ДокументЗаявка = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.бит_пз_СводнаяЗаявкаНаЗатраты"));
	
	мКэшЗначений.Вставить("ИзмеренияДоп"      		  , ДокументЗаявка.мИзмеренияДоп);
	мКэшЗначений.Вставить("НастройкиИзмерений"		  , ДокументЗаявка.мНастройкиИзмерений);
	мКэшЗначений.Вставить("ВалютаРеглУчета"			  , Константы.ВалютаРегламентированногоУчета.Получить());
	
	// Запишем параметр для формирования заголовка.
	мКэшЗначений.Вставить("ПредставлениеОбъекта", Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	
КонецПроцедуры

//  Процедура управляем видимостью-доступностью элементов формы. 
// 
&НаСервере
Процедура УправлениеЭлементамиФормы()

	бит_НастройкиДоступностиЭлементовФорм.РазблокироватьЭлементы(ЭтотОбъект);
	
	// Управление доступностью некоторых элементов в зависимости от статуса Черновик.
	Если ТипСтатуса <> Перечисления.бит_ТипыСтатусовОбъектов.Черновик Тогда
		Элементы.ЗаявкиНаЗатраты.КоманднаяПанель.Доступность = Ложь;
		Элементы.ЗаявкиНаЗатраты.КонтекстноеМеню.Доступность = Ложь;
	Иначе
		Элементы.ЗаявкиНаЗатраты.КоманднаяПанель.Доступность = Истина;
		Элементы.ЗаявкиНаЗатраты.КонтекстноеМеню.Доступность = Истина;
	КонецЕсли;
	
	бит_НастройкиДоступностиЭлементовФорм.ЗаблокироватьЭлементы(ЭтотОбъект);
	
КонецПроцедуры

// Процедура пересчитывает суммы табличной части при изменении цены или количества.
// 
&НаКлиентеНаСервереБезКонтекста
Процедура ПриИзмененииКоличествоЦена(Сумма, Количество, Цена, СуммаНДС, Всего, СтавкаНДС)

	Сумма = Цена * Количество;
	
	СуммаНДС = бит_БухгалтерияКлиентСервер.РассчитатьСуммуНДС(Сумма,
					Истина, Ложь, бит_БухгалтерияВызовСервера.ПолучитьСтавкуНДС(СтавкаНДС));
	
	Всего = Сумма + СуммаНДС;

КонецПроцедуры // ПриИзмененииКоличествоЦена()

//  Процедура обновляет итоги по всем суммам.
// 
// Параметры:
//  СтрокаТабличнойЧасти - строка табличной части документа.
// 
&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьИтоги(Форма)

	Объект = Форма.Объект;

	Форма.ИтогиВсего    = Объект.ЗаявкиНаЗатраты.Итог("СуммаСНДС");
	Форма.ИтогиВсегоНДС = Объект.ЗаявкиНаЗатраты.Итог("СуммаНДС");
	
КонецПроцедуры

//  Процедура обрабатывает заполнение табличной части из подбора заявок на потребность.
// 
// Параметры:
//  СтрЗаполнения - Структура.
// 
&НаСервере
Процедура ОбработкаЗаполненияИзПодбора(СтрЗаполнения)

	Если СтрЗаполнения.ОчищатьТабЧасть Тогда
	
		Объект.ЗаявкиНаЗатраты.Очистить();
	
	КонецЕсли; 
	
	ТаблицаПодбор = бит_ОбщегоНазначения.РаспаковатьТаблицуЗначений(СтрЗаполнения.Хранилище);
	
	Для каждого Строка Из ТаблицаПодбор Цикл
	
		СтрОтбора = Новый Структура;
		СтрОтбора.Вставить("Номенклатура"	, Строка.Номенклатура);
		СтрОтбора.Вставить("ЗаявкаНаЗатраты", Строка.ЗаявкаНаЗатраты);
		СтрОтбора.Вставить("Характеристика"	, Строка.Характеристика);
		НайденныеСтроки = Объект.ЗаявкиНаЗатраты.НайтиСтроки(СтрОтбора);
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			НайденныеСтроки[0].Количество 	= НайденныеСтроки[0].Количество + Строка.Количество;
			НайденныеСтроки[0].Сумма 		= НайденныеСтроки[0].Сумма 		+ Строка.Сумма;
			НайденныеСтроки[0].СуммаНДС 	= НайденныеСтроки[0].СуммаНДС 	+ Строка.СуммаНДС;
			НайденныеСтроки[0].СуммаСНДС 	= НайденныеСтроки[0].СуммаСНДС 	+ Строка.СуммаСНДС;
			
		Иначе
			
			НоваяСтрока = Объект.ЗаявкиНаЗатраты.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			
			Если ТипЗнч(Строка.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
			
				НоваяСтрока.Упаковка = Строка.Номенклатура.ЕдиницаИзмерения;
			
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры // ОбработкаЗаполненияИзПодбора()

//  Процедура открывает обработку подбора заявок на затраты. 
//
&НаКлиенте
Процедура ОткрытиеОбработкиПодборЗаявокНаЗатраты()

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Документ"		, Объект.Ссылка);
	СтруктураПараметров.Вставить("ИмяМакета"	, "СКД");
	СтруктураПараметров.Вставить("ИмяСобытия"	, "ПодборЗаявокНаЗатраты");
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СтруктураПараметров",	СтруктураПараметров);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", 	Истина);
	
	ОткрытьФорму("Обработка.бит_пз_ПодборЗаявокНаЗатраты.Форма.Форма", ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры // ОткрытиеОбработкиПодборЗаявокНаЗатраты()

//  Процедура при изменении валюты на сервере. 
//
&НаСервере
Процедура ВалютаДокументаПриИзмененииСервер()

	ДокументЗаявка = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.бит_пз_СводнаяЗаявкаНаЗатраты"));
	ДокументЗаявка.ИзменениеВалютыМодуль();
	
	ЗначениеВДанныеФормы(ДокументЗаявка, Объект);

КонецПроцедуры // ВалютаДокументаПриИзмененииСервер()

//  Процедура пересчитывает суммы табличной части при суммы.
// 
&НаКлиентеНаСервереБезКонтекста
Процедура ПриИзмененииСумма(Сумма, СуммаНДС, Всего, СтавкаНДС)

	СуммаНДС = бит_БухгалтерияКлиентСервер.РассчитатьСуммуНДС(
										Сумма,
										Истина,
										Ложь,
										бит_БухгалтерияВызовСервера.ПолучитьСтавкуНДС(СтавкаНДС));
										
	Всего = Сумма + СуммаНДС;									

КонецПроцедуры // ПриИзмененииСумма()

//  Процедура обработка события ПриИзменении поля Номенклатура. 
//
&НаСервере
Процедура НоменклатураПриИзмененииСервер(ИД)

	СтрокаТабличнойЧасти = Объект.ЗаявкиНаЗатраты.НайтиПоИдентификатору(ИД);
	СтрокаТабличнойЧасти.Упаковка = СтрокаТабличнойЧасти.Номенклатура.ЕдиницаИзмерения;

КонецПроцедуры // НоменклатураПриИзмененииСервер()

&НаСервере
Процедура ПодготовитьФормуНаСервере(СтандартнаяОбработка = Ложь)

	бит_НастройкиДоступностиЭлементовФорм.ПодготовитьФорму(ЭтотОбъект, Объект, СтандартнаяОбработка);
	УстановитьСостояниеДокумента();
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаОповещенияИзмененияСтатуса()
	
	Прочитать();
	
КонецПроцедуры

#КонецОбласти
